### Imports

In [1]:
import sys
sys.path.append('../')

from wavy import *
import pandas as pd

### Load data

In [2]:
data_pd = pd.read_pickle('processed.pkl')
data_pd = data_pd.iloc[0:2,:]
data_pd = data_pd.loc[:, (['MSFT', 'AAPL'], ['Open', 'Close'])]
data_pd

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### DataBlock from single level DataFrame

In [3]:
data = data_pd.loc[:, 'AAPL']
data

                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [4]:
datablock = from_dataframe(data, 'AAPL')
datablock

                AAPL
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [5]:
type(datablock)

wavy.block.TimeBlock

### DataBlock from multi level DataFrame

In [6]:
datablock = from_dataframe(data_pd)
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Function `filter`

In [7]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [8]:
datablock.filter(assets=['AAPL'], channels=['Open'])

                AAPL
                Open
Date
2005-12-21  2.218566
2005-12-22  2.258598

### Function `drop`

In [9]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [10]:
datablock.drop(assets=['AAPL'], channels=['Open'])

                 MSFT
                Close
Date
2005-12-21  19.475122
2005-12-22  19.373114

### Comparison between `add_level` and `new_add_level`

The old function `add_level` seems wrong, it is adding asset above Date, new function proposed.

In [11]:
level = data.loc[:, 'AAPL']
level = pd.concat({'level_0': level.T}, names=['level_0']).T
level

level_0      level_0
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [12]:
new_level = data.loc[:, 'AAPL']
new_level.columns = pd.MultiIndex.from_product([['level_0'], new_level.columns])
new_level

             level_0
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

### Rename assets

In [13]:
datablock
dict = {'AAPL': 'Apple', 'MSFT': 'Microsoft'}
datablock.rename_assets(dict)

            Microsoft                Apple
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Rename channels

In [14]:
datablock
dict = {'Open': 'Op', 'Close': 'Cl'}
datablock.rename_channels(dict)

                 MSFT                 AAPL
                   Op         Cl        Op        Cl
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Function apply

In [15]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [16]:
datablock.apply(np.max, axis=1)

                 MSFT      AAPL
                 amax      amax
Date
2005-12-21  19.577126  2.246069
2005-12-22  19.460543  2.261960

### Function `swap_cols`

In [17]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [18]:
datablock.swap_cols()

                Close                 Open
                 MSFT      AAPL       MSFT      AAPL
Date
2005-12-21  19.475122  2.246069  19.577126  2.218566
2005-12-22  19.373114  2.261960  19.460543  2.258598

### Function `sort_assets`

In [19]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [20]:
datablock.sort_assets()

                AAPL                 MSFT
                Open     Close       Open      Close
Date
2005-12-21  2.218566  2.246069  19.577126  19.475122
2005-12-22  2.258598  2.261960  19.460543  19.373114

### Function `sort_channels`

In [21]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [22]:
datablock.sort_channels()

                 MSFT                 AAPL
                Close       Open     Close      Open
Date
2005-12-21  19.475122  19.577126  2.246069  2.218566
2005-12-22  19.373114  19.460543  2.261960  2.258598

### Function `countna`

In [23]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [24]:
datablock.matrix[0][2] = np.nan
datablock.matrix[1][1] = np.nan
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [25]:
datablock.countna('asset')

MSFT    1
AAPL    1
dtype: int64

In [26]:
datablock.countna('channel')

MSFT  Open     0
      Close    1
AAPL  Open     1
      Close    0
dtype: int64

### Function `split_assets`

In [27]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [28]:
datablock.split_assets()

[                 MSFT
                  Open      Close
 Date
 2005-12-21  19.577126  19.475122
 2005-12-22  19.460543        NaN,
                 AAPL
                 Open     Close
 Date
 2005-12-21       NaN  2.246069
 2005-12-22  2.258598  2.261960]

### Function `from_dataframes`

#### From a `dict`

In [29]:
AAPL = data_pd.loc[:, 'AAPL']
MSFT = data_pd.loc[:, 'MSFT']

dict = {'AAPL': AAPL, 'MSFT': MSFT}
dict

{'AAPL':                 Open     Close
 Date
 2005-12-21       NaN  2.246069
 2005-12-22  2.258598  2.261960,
 'MSFT':                  Open      Close
 Date
 2005-12-21  19.577126  19.475122
 2005-12-22  19.460543        NaN}

In [30]:
from_dictionary(dict)

                AAPL                 MSFT
                Open     Close       Open      Close
Date
2005-12-21       NaN  2.246069  19.577126  19.475122
2005-12-22  2.258598  2.261960  19.460543        NaN

#### From a `data`

In [31]:
aapl = data_pd.loc[:, 'AAPL']
aapl

                Open     Close
Date
2005-12-21       NaN  2.246069
2005-12-22  2.258598  2.261960

In [32]:
msft = data_pd.loc[:, 'MSFT']
msft

                 Open      Close
Date
2005-12-21  19.577126  19.475122
2005-12-22  19.460543        NaN

In [33]:
from_dataframes([aapl, msft])

             asset_0              asset_1
                Open     Close       Open      Close
Date
2005-12-21       NaN  2.246069  19.577126  19.475122
2005-12-22  2.258598  2.261960  19.460543        NaN

#### From `data`, `assets`

In [34]:
aapl = data_pd.loc[:, 'AAPL']
aapl

                Open     Close
Date
2005-12-21       NaN  2.246069
2005-12-22  2.258598  2.261960

In [35]:
msft = data_pd.loc[:, 'MSFT']
msft

                 Open      Close
Date
2005-12-21  19.577126  19.475122
2005-12-22  19.460543        NaN

In [36]:
from_dataframes([aapl, msft], ['AAPL', 'MSFT'])

                AAPL                 MSFT
                Open     Close       Open      Close
Date
2005-12-21       NaN  2.246069  19.577126  19.475122
2005-12-22  2.258598  2.261960  19.460543        NaN

### Try `from_dataframes` with multilevel

In [37]:
AAPL = data_pd.loc[:, 'AAPL']
AAPL.columns = pd.MultiIndex.from_product([['level_0'], AAPL.columns])
MSFT = data_pd.loc[:, 'MSFT']

try:
    datablock = from_dataframes([AAPL, MSFT], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

Data cannot be multilevel

### Try `from_dataframes` with not a DataFrame

In [38]:
AAPL = data_pd.loc[:, 'AAPL']

try:
    datablock = from_dataframes([AAPL, 1], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

Data must be a DataFrame

### Try `from_dataframes` with different number of channels

In [39]:
AAPL = data_pd.loc[:, 'AAPL'].copy()
AAPL.drop('Close', axis=1, inplace=True)
MSFT = data_pd.loc[:, 'MSFT']

try:
    datablock = from_dataframes([AAPL, MSFT], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

Data with different number of channels

### Error using DataFrame instead of DataBlock

In [40]:
simp_data = data_pd.iloc[:, 0:4]
print(id(data_pd))
print(id(simp_data))
assets = simp_data.columns.levels[0]
assets

4431136992
5801521648

Index(['HWM', 'LNC', 'MAS', 'AMT', 'IEX', 'QCOM', 'ANTM', 'GE', 'VIAC', 'ADBE',
       ...
       'COO', 'REG', 'BIIB', 'CCL', 'ALGN', 'PFE', 'CPB', 'STX', 'CSX', 'CI'],
      dtype='object', length=505)

In [41]:
simp_datablock = datablock.iloc[:, 0:4]
print(id(data))
print(id(simp_datablock))
assets = simp_datablock.columns.levels[0]
assets

5800582304
5801521360

Index(['HWM', 'LNC', 'MAS', 'AMT', 'IEX', 'QCOM', 'ANTM', 'GE', 'VIAC', 'ADBE',
       ...
       'COO', 'REG', 'BIIB', 'CCL', 'ALGN', 'PFE', 'CPB', 'STX', 'CSX', 'CI'],
      dtype='object', length=505)

### Function `from_matrix`

In [56]:
values = datablock.values
index = datablock.index
assets = datablock.assets
channels = datablock.channels

In [57]:
values

array([[19.57712554, 19.47512245,         nan,  2.24606872],
       [19.46054323,         nan,  2.25859845,  2.26195979]])

In [58]:
index

DatetimeIndex(['2005-12-21', '2005-12-22'], dtype='datetime64[ns]', name='Date', freq=None)

In [59]:
assets

0    MSFT
1    AAPL
dtype: object

In [60]:
from_matrix(values, index=index, assets=assets, channels=channels)

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

### Function `from_tensor`

In [61]:
simp_datablock = datablock.iloc[:, 0:10]
index = list(simp_datablock.index)
assets = list(simp_datablock.assets)
channels = list(simp_datablock.channels)
values = list(np.array([simp_datablock.iloc[:, i*2:i*2+2].values for i in range(2)]))

In [62]:
values

[array([[19.57712554, 19.47512245],
        [19.46054323,         nan]]),
 array([[       nan, 2.24606872],
        [2.25859845, 2.26195979]])]

In [63]:
index

[Timestamp('2005-12-21 00:00:00'), Timestamp('2005-12-22 00:00:00')]

In [64]:
assets

['MSFT', 'AAPL']

In [65]:
from_tensor(values, index=index, assets=assets, channels=channels)

                 MSFT                 AAPL
                 Open      Close      Open     Close
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

### Function as_dataframe

In [66]:
type(datablock)

wavy.block.TimeBlock

In [68]:
type(datablock.as_dataframe())

pandas.core.frame.DataFrame

# Properties
### matrix

In [69]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [70]:
datablock.matrix

array([[19.57712554, 19.47512245,         nan,  2.24606872],
       [19.46054323,         nan,  2.25859845,  2.26195979]])

### tensor

In [71]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [73]:
datablock.tensor

array([[[19.57712554, 19.47512245],
        [19.46054323,         nan]],

       [[        nan,  2.24606872],
        [ 2.25859845,  2.26195979]]])

### Channels

In [74]:
datablock.channels

0     Open
1    Close
dtype: object

### Assets

In [75]:
datablock.assets

0    MSFT
1    AAPL
dtype: object

In [76]:
datablock.start

Timestamp('2005-12-21 00:00:00')

In [77]:
datablock.end

Timestamp('2005-12-22 00:00:00')